{ "translations": {
    "Missing recovery key password" : "كلمة مرور مفتاح الاسترداد مفقودة",
    "Please repeat the recovery key password" : "يُرجى تكرار كلمة مرور مفتاح الاسترداد",
    "Repeated recovery key password does not match the provided recovery key password" : "لا تتوافق كلمة مرور مفتاح الاسترداد المكررة مع كلمة مرور مفتاح الاسترداد المقدمة",
    "Recovery key successfully enabled" : "تم تفعيل مفتاح الاسترداد بنجاح",
    "Could not enable recovery key. Please check your recovery key password!" : "لا يمكن تفعيل مفتاح الاسترداد، يُرجى التحقق من كلمة مرور مفتاح الاسترداد!",
    "Recovery key successfully disabled" : "تم تعطيل مفتاح الاسترداد بنجاح",
    "Could not disable recovery key. Please check your recovery key password!" : "لا يمكن تعطيل مفتاح الاسترداد، يُرجى التحقق من كلمة مرور مفتاح الاسترداد!",
    "Missing parameters" : "معلمات مفقودة",
    "Please provide the old recovery password" : "يُرجى توفير كلمة مرور الاسترداد القديمة",
    "Please provide a new recovery password" : "يُرجى توفير كلمة مرور استرداد جديدة",
    "Please repeat the new recovery password" : "يُرجى تكرار كلمة مرور الاسترداد الجديدة",
    "Password successfully changed." : "تم تغيير كلمة المرور بنجاح.",
    "Could not change the password. Maybe the old password was not correct." : "تعذّر تغيير كلمة المرور. من الممكن أن كلمة المرور القديمة غير صحيحة.",
    "Recovery Key disabled" : "تم تعطيل مفتاح الاسترداد",
    "Recovery Key enabled" : "تم تفعيل مفتاح الاسترداد",
    "Could not enable the recovery key, please try again or contact your administrator" : "تعذّر تمكين مفتاح الاسترداد، يُرجى المحاولة مرة أخرى أو الاتصال بالمسؤول",
    "Could not update the private key password." : "تعذّر تحديث كلمة مرور المفتاح الخاص.",
    "The old password was not correct, please try again." : "كلمة المرور القديمة غير صحيحة، يُرجى المحاولة مرة أخرى.",
    "The current log-in password was not correct, please try again." : "كلمة مرور تسجيل الدخول الحالية غير صحيحة، يُرجى المحاولة مرة أخرى.",
    "Private key password successfully updated." : "تم تحديث كلمة مرور المفتاح الخاص بنجاح.",
    "You need to migrate your encryption keys from the old encryption (ownCloud <= 8.0) to the new one. Please run 'occ encryption:migrate' or contact your administrator" : "تحتاج إلى ترحيل مفاتيح التشفير من التشفير القديم (ownCloud <= 8.0) إلى التشفير الجديد. يُرجى تشغيل \"occ encryption:migrate\" أو الاتصال بمسؤولك",
    "Invalid private key for Encryption App. Please update your private key password in your personal settings to recover access to your encrypted files." : "مفتاح خاص غير صالح لتطبيق التشفير. يُرجى تحديث كلمة مرور المفتاح الخاص من الإعدادات الشخصية لاسترداد الوصول إلى الملفات المشفرة.",
    "Encryption App is enabled, but your keys are not initialized. Please log-out and log-in again." : "تم تمكين تطبيق التشفير، لكن لم تتم تهيئة المفاتيح. لذا يُرجى تسجيل الخروج ثم تسجيل الدخول مرة أخرى.",
    "Encryption App is enabled and ready" : "تم تمكين تطبيق التشفير وتجهيزه للعمل",
    "Bad Signature" : "توقيع سيء",
    "Missing Signature" : "توقيع مفقود",
    "one-time password for server-side-encryption" : "كلمة مرور تصلح لمرة واحدة للتشفير من جانب الخادم",
    "Can not decrypt this file, probably this is a shared file. Please ask the file owner to reshare the file with you." : "لا يمكن فك تشفير هذا الملف، من الممكن أن يكون هذا الملف مُشارك. يُرجى طلب إعادة مشاركته معك من مالك الملف.",
    "Can not read this file, probably this is a shared file. Please ask the file owner to reshare the file with you." : "لا يمكن فك قراءة هذا الملف، من الممكن أن يكون هذا الملف مُشارك. يُرجى طلب إعادة مشاركته معك من مالك الملف.",
    "Hey there,\n\nthe admin enabled server-side-encryption. Your files were encrypted using the password '%s'.\n\nPlease login to the web interface, go to the section 'ownCloud basic encryption module' of your personal settings and update your encryption password by entering this password into the 'old log-in password' field and your current login-password.\n\n" : "مرحبا،\n\nمكّن المسؤول ميزة التشفير من جانب الخادم. تم تشفير ملفاتك باستخدام كلمة المرور '%s'.\n\nيُرجى تسجيل الدخول إلى واجهة الويب، والانتقال إلى القسم 'وحدة التشفير الأساسية لـ ownCloud' الخاصة بإعداداتك الشخصية وتحديث كلمة مرور التشفير الخاصة بك عن طريق إدخال كلمة المرور هذه في حقل 'كلمة مرور تسجيل الدخول القديمة' وكلمة مرور تسجيل الدخول الحالية.\n\n",
    "The share will expire on %s." : "ستنتهي صلاحية المشاركة في %s.",
    "Cheers!" : "تهانينا!",
    "Hey there,<br><br>the admin enabled server-side-encryption. Your files were encrypted using the password <strong>%s</strong>.<br><br>Please login to the web interface, go to the section \"ownCloud basic encryption module\" of your personal settings and update your encryption password by entering this password into the \"old log-in password\" field and your current login-password.<br><br>" : "مرحبا،<br><br>مكّن المسؤول ميزة التشفير من جانب الخادم. تم تشفير ملفاتك باستخدام كلمة المرور <strong>%s</strong>.<br><br>يُرجى تسجيل الدخول إلى واجهة الويب، والانتقال إلى القسم \"وحدة التشفير الأساسية لـ ownCloud\" الخاصة بإعداداتك الشخصية وتحديث كلمة مرور التشفير الخاصة بك عن طريق إدخال كلمة المرور هذه في حقل \"كلمة مرور تسجيل الدخول القديمة\" وكلمة مرور تسجيل الدخول الحالية.<br><br>",
    "Default encryption module" : "وحدة التشفير الافتراضية",
    "Encryption App is enabled but your keys are not initialized, please log-out and log-in again" : "تم تمكين تطبيق التشفير، لكن لم تتم تهيئة المفاتيح، لذا يُرجى تسجيل الخروج ثم تسجيل الدخول مرة أخرى",
    "Encryption type: Master Key" : "نوع التشفير: مفتاح رئيسي",
    "Encryption type: User Specific Key" : "نوع التشفير: مفتاح محدد للمستخدم",
    "Please select an encryption option" : "يُرجى تحديد خيار تشفير",
    "Master Key" : "مفتاح رئيسي",
    "User-specific key" : "مفتاح محدد للمستخدم",
    "Permanently select this mode" : "حدد هذا الوضع نهائيًا",
    "Encrypt the home storage" : "شفّر وحدة التخزين الرئيسية",
    "Enabling this option encrypts all files stored on the main storage, otherwise only files on external storage will be encrypted" : "يؤدي تمكين هذا الخيار إلى تشفير جميع الملفات المخزنة على وحدة التخزين الرئيسية، وإلا سيتم تشفير الملفات الموجودة على وحدة التخزين الخارجية فقط",
    "Enable recovery key" : "مكِّن مفتاح الاسترداد",
    "Disable recovery key" : "عطِّل مفتاح الاسترداد",
    "The recovery key is an extra encryption key that is used to encrypt files. It allows recovery of a user's files if the user forgets his or her password." : "مفتاح الاسترداد هو مفتاح تشفير إضافي يُستخدم لتشفير الملفات. يسمح باسترداد ملفات المستخدم إذا نسى المستخدم كلمة مروره.",
    "Recovery key password" : "كلمة مرور مفتاح الاسترداد",
    "Repeat recovery key password" : "كرّر كلمة مرور مفتاح الاسترداد",
    "Change recovery key password:" : "غيّر كلمة مرور مفتاح الاسترداد:",
    "Old recovery key password" : "كلمة مرور مفتاح الاسترداد القديمة",
    "New recovery key password" : "كلمة مرور مفتاح الاسترداد الجديدة",
    "Repeat new recovery key password" : "كرّر كلمة مرور مفتاح الاسترداد الجديدة",
    "Change Password" : "تغيير كلمة المرور",
    "ownCloud basic encryption module" : "وحدة التشفير الرئيسية في ownCloud",
    "Your private key password no longer matches your log-in password." : "لم تعد كلمة مرور مفتاحك الخاص تطابق كلمة مرور تسجيل دخولك.",
    "Set your old private key password to your current log-in password:" : "اضبط كلمة مرور مفتاحك الخاص القديمة على كلمة مرور تسجيل دخولك الحالية:",
    " If you don't remember your old password you can ask your administrator to recover your files." : " اذا كنت لا تتذكر كلمة المرور القديمة يمكن أن تطلب من مسؤولك استعادة ملفاتك.",
    "Old log-in password" : "كلمة مرور تسجيل الدخول القديمة",
    "Current log-in password" : "كلمة مرور تسجيل الدخول الحالية",
    "Update Private Key Password" : "تحديث كلمة مرور المفتاح الخاص",
    "Enable password recovery:" : "مكِّن استرداد كلمة المرور:",
    "Enabling this option will allow you to reobtain access to your encrypted files in case of password loss" : "سيسمح لك تفعيل هذا الخيار بإعادة الوصول إلى ملفاتك المشفرة عند فقدان كلمة المرور",
    "Enabled" : "مُفعَّل",
    "Disabled" : "مُعطَّل"
},"pluralForm" :"nplurals=6; plural=n==0 ? 0 : n==1 ? 1 : n==2 ? 2 : n%100>=3 && n%100<=10 ? 3 : n%100>=11 && n%100<=99 ? 4 : 5;"
}